# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
# tap 'homebrew-core'

# Fonts
cask 'font-fira-code'

# test
# Apps
# cask 'iterm2'
# cask 'google-chrome'
# cask 'visual-studio-code'

# Development
# brew 'argocd'
brew 'fzf'
brew 'git'
brew 'terraform'
# brew 'go'
brew 'helm'
brew 'k9s'
brew 'kubectx'
brew 'kustomize'
brew 'minikube'
brew 'neovim'
# brew 'pyenv'
# # brew 'starship'
# brew 'tmux'
brew 'tree'
# brew 'trivy'
# brew 'zsh'
# brew 'zsh-syntax-highlighting'
# brew 'tmux'

##################################
cask 'google-cloud-sdk'
brew 'glab'
brew 'tfsec'
brew 'shellcheck'
# pre-commit terraform
brew 'pre-commit'
brew 'mini/stable/mc'
brew 'krew'
brew 'jq' # need to set path afterwards
brew 'terragrunt'
brew 'ripgrep'
brew 'go'
brew 'golangci-lint'
brew 'terraform-docs'
brew 'pre-commit'
brew 'bash' # upgrade bash to new versions. Needed for new bash functions.